In [3]:
import numpy as np
import pandas as pd

In [4]:
date = pd.read_csv('datasets/orders.csv')
time = pd.read_csv('datasets/messages.csv')

In [5]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [6]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [8]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [9]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with Dates

In [10]:
date['date'] = pd.to_datetime(date['date'])

In [11]:
date['date_year'] = date['date'].dt.year

In [12]:
date['date_month_no'] = date['date'].dt.month

In [13]:
date['date_month_name'] = date['date'].dt.month_name()

In [14]:
date['date_day'] = date['date'].dt.day

In [15]:
# day of week
date['date_dow'] = date['date'].dt.dayofweek

In [16]:
date['date_dow_name'] = date['date'].dt.day_name()

In [19]:
date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [22]:
date['day_is_weekend'] = np.where(date['date_dow'].isin([5, 6]), 1, 0)

In [24]:
date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,day_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

In [28]:
# Extract Week of year
date['date_week'] = date['date'].dt.isocalendar().week

In [31]:
# Extract Quarter
date['date_qtr'] = date['date'].dt.quarter

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,day_is_weekend,date_week,date_qtr
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1,1,1

### Exact Semester

In [34]:
date['semester'] = np.where(date['date_qtr'].isin([1, 2]), 1, 2)

In [35]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,day_is_weekend,date_week,date_qtr,semester
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1,1,1,1

### Time elapsed betweek 2 dates

In [36]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2024, 12, 29, 1, 44, 35, 284439)

In [37]:
today - date['date'] # How many days ago this was...

0     1846 days 01:44:35.284439
1     2328 days 01:44:35.284439
2     2259 days 01:44:35.284439
3     1961 days 01:44:35.284439
4     2184 days 01:44:35.284439
                 ...
995   2274 days 01:44:35.284439
996   2215 days 01:44:35.284439
997   2063 days 01:44:35.284439
998   2128 days 01:44:35.284439
999   1902 days 01:44:35.284439
Name: date, Length: 1000, dtype: timedelta64[ns]

In [41]:
# Number of days elapsed
(today - date['date']).dt.days

0      1846
1      2328
2      2259
3      1961
4      2184
       ...
995    2274
996    2215
997    2063
998    2128
999    1902
Name: date, Length: 1000, dtype: int64

In [52]:
# Number of months elapsed
np.round((today - date['date']) / np.timedelta64(1, 'D') / 30, 0)

0      62.0
1      78.0
2      75.0
3      65.0
4      73.0
       ...
995    76.0
996    74.0
997    69.0
998    71.0
999    63.0
Name: date, Length: 1000, dtype: float64

# Handling Date

In [53]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [54]:
time['date'] = pd.to_datetime(time['date'])

In [55]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [56]:
time['time'] = time['date'].dt.time

In [57]:
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [58]:
# Time Difference

today - time['date']

0     4032 days 00:54:35.284439
1     3896 days 02:04:35.284439
2     4382 days 01:23:35.284439
3     3684 days 01:13:35.284439
4     4081 days 02:33:35.284439
                 ...
995   4671 days 00:54:35.284439
996   3992 days 02:30:35.284439
997   4457 days 02:07:35.284439
998   4573 days 02:10:35.284439
999   3845 days 02:19:35.284439
Name: date, Length: 1000, dtype: timedelta64[ns]

In [60]:
# in seconds
(today - time['date']) / np.timedelta64(1, 's')

0      3.483681e+08
1      3.366219e+08
2      3.786098e+08
3      3.183020e+08
4      3.526076e+08
           ...
995    4.035777e+08
996    3.449178e+08
997    3.850925e+08
998    3.951150e+08
999    3.322164e+08
Name: date, Length: 1000, dtype: float64

In [61]:
# in minutes
(today - time['date']) / np.timedelta64(1, 'm')

0      5.806135e+06
1      5.610365e+06
2      6.310164e+06
3      5.305034e+06
4      5.876794e+06
           ...
995    6.726295e+06
996    5.748631e+06
997    6.418208e+06
998    6.585251e+06
999    5.536940e+06
Name: date, Length: 1000, dtype: float64

In [62]:
# in hours
(today - time['date']) / np.timedelta64(1, 'h')

0       96768.909801
1       93506.076468
2      105169.393135
3       88417.226468
4       97946.559801
           ...
995    112104.909801
996     95810.509801
997    106970.126468
998    109754.176468
999     92282.326468
Name: date, Length: 1000, dtype: float64

In [ ]:
# We might not need more details that this....